import random

class Generation:
    names = ["Анна", "Борис", "Виктория", "Глеб"]
    random_surnames = ['Иванов', 'Петров', 'Сидоров', 'Козлова', 'Орлова']
    streets = ['ул. Мира', 'ул. Ленина', 'пр. Победы', 'ул. Садовая', 'ул. Гагарина']
    colors_scooter = ['black', 'grey']
    rent_period = ['сутки', 'двое суток', 'трое суток', 'четверо суток', 'пятеро суток', 'шестеро суток', 'семеро суток']
    metros = [
        "Бульвар Рокоссовского",
        "Черкизовская",
        "Преображенская площадь",
        "Сокольники",
        "Красносельская",
        "Комсомольская",
        "Красные Ворота",
        "Чистые пруды",
        "Лубянка",
        "Охотный Ряд",
        "Библиотека имени Ленина",
        "Кропоткинская",
        "Парк культуры",
        "Фрунзенская",
        "Спортивная",
        "Воробьёвы горы",
        "Университет",
        "Проспект Вернадского",
        "Юго-Западная",
        "Тропарёво",
        "Румянцево",
        "Саларьево",
        "Филёвский парк",
        "Киевская",
        "Курская",
        "Павелецкая",
        "Добрынинская",
        "Октябрьская",
        "Новослободская",
        "Маяковская",
        "Тверская",
        "Пушкинская",
        "Чеховская",
        "Таганская",
        "Кузнецкий мост",
        "Китай-город",
        "Третьяковская",
        "Полянка",
        "Серпуховская",
        "Тульская",
        "Нагатинская",
        "Нагорная",
        "Нахимовский проспект",
        "Севастопольская",
        "Чертановская",
        "Южная",
        "Пражская",
        "Улица Академика Янгеля",
        "Аннино",
        "Бульвар Дмитрия Донского"
    ]

    random_name = random.choice(names)
    random_date = random.randint(1,28)
    random_adress = f'{random.choice(streets)}, д. {random.randint(1, 100)}'
    random_surname = random.choice(random_surnames)
    random_metro = random.choice(metros)
    random_phone = f'+7{random.randint(9000000000, 9999999999)}'
    random_color = random.choice(colors_scooter)
    random_rent_period = random.choice(rent_period)